0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletJet
    {
        type  fixedValue;
        value uniform (56 0 0);
    }

    inletLow
    {
        type  fixedValue;
        value uniform (1.1 0 0);
    }

    inletHigh
    {
        type  fixedValue;
        value uniform (1.1 0 0);
    }

    outlet
    {
        type  zeroGradient;
    }

    upperWall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    lowerWall
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type  empty;
    }
}


// ************************************************************************* //
