system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001;

vertices
(
    (0   -55 -0.1)  //0
    (0   -2 -0.1)  //1
    (0    2 -0.1)  //2
    (0    55  -0.1)  //3

    (200   -55 -0.1)  //4
    (200   -2 -0.1)  //5
    (200   2 -0.1)  //6
    (200    55  -0.1)  //7

    (0   -55  0.1)  //8
    (0   -2  0.1)  //9
    (0    2  0.1)  //10
    (0    55   0.1)  //11

    (200   -55  0.1)  //12
    (200   -2  0.1)  //13
    (200    2  0.1)  //14
    (200    55   0.1)  //15
);

blocks
(
    hex (0 4 5 1 8 12 13 9)    (200 60 1) simpleGrading (1 0.2 1)
    hex (1 5 6 2 9 13 14 10)   (200 10 1) simpleGrading (1 1 1)
    hex (2 6 7 3 10 14 15 11)  (200 60 1) simpleGrading (1 5 1)
);

edges
(
);

boundary
(
    inletLow
    {
        type patch;
        faces
        (
            (0 1 9 8)
        );
    }

    inletJet
    {
        type patch;
        faces
        (
            (1 2 10 9)
        );
    }

    inletHigh
    {
        type patch;
        faces
        (
            (2 3 11 10)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
        );
    }

    upperWall
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }

    lowerWall
    {
        type patch;
        faces
        (
            (0 4 12 8)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)

            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
        );
    }
);

// ************************************************************************* //